In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [6]:
df = pd.DataFrame(randn(6,3),index='A B C D E F'.split(),columns='1 2 3'.split())

In [7]:
df

          1         2         3
A  2.605967  0.683509  0.302665
B  1.693723 -1.706086 -1.159119
C -0.134841  0.390528  0.166905
D  0.184502  0.807706  0.072960
E  0.638787  0.329646 -0.497104
F -0.754070 -0.943406  0.484752

In [10]:
df['1']

A    2.605967
B    1.693723
C   -0.134841
D    0.184502
E    0.638787
F   -0.754070
Name: 1, dtype: float64

In [12]:
df['1'][5]

-0.7540697010400628

In [13]:
df['1'][0:3]

A    2.605967
B    1.693723
C   -0.134841
Name: 1, dtype: float64

In [14]:
type(df['1'])

pandas.core.series.Series

In [27]:
df['min']=[10,11,12,13,14,15]
df['test1']=[20,22,24,26,28,30]
df

          1         2         3  min  test1
A  2.605967  0.683509  0.302665   10     20
B  1.693723 -1.706086 -1.159119   11     22
C -0.134841  0.390528  0.166905   12     24
D  0.184502  0.807706  0.072960   13     26
E  0.638787  0.329646 -0.497104   14     28
F -0.754070 -0.943406  0.484752   15     30

In [28]:
df.min

<bound method NDFrame._add_numeric_operations.<locals>.min of           1         2         3  min  test1
A  2.605967  0.683509  0.302665   10     20
B  1.693723 -1.706086 -1.159119   11     22
C -0.134841  0.390528  0.166905   12     24
D  0.184502  0.807706  0.072960   13     26
E  0.638787  0.329646 -0.497104   14     28
F -0.754070 -0.943406  0.484752   15     30>

In [33]:
df.test1

A    20
B    22
C    24
D    26
E    28
F    30
Name: test1, dtype: int64

In [30]:
df['min']

A    10
B    11
C    12
D    13
E    14
F    15
Name: min, dtype: int64

In [31]:
df['test1']

A    20
B    22
C    24
D    26
E    28
F    30
Name: test1, dtype: int64

In [34]:
df[['1','test1']]

          1  test1
A  2.605967     20
B  1.693723     22
C -0.134841     24
D  0.184502     26
E  0.638787     28
F -0.754070     30

In [35]:
df.loc['A']

1         2.605967
2         0.683509
3         0.302665
min      10.000000
test1    20.000000
Name: A, dtype: float64

In [38]:
df.loc['A':'D']

          1         2         3  min  test1
A  2.605967  0.683509  0.302665   10     20
B  1.693723 -1.706086 -1.159119   11     22
C -0.134841  0.390528  0.166905   12     24
D  0.184502  0.807706  0.072960   13     26

In [39]:
df.iloc[2]

1        -0.134841
2         0.390528
3         0.166905
min      12.000000
test1    24.000000
Name: C, dtype: float64

In [40]:
df.iloc[-1]

1        -0.754070
2        -0.943406
3         0.484752
min      15.000000
test1    30.000000
Name: F, dtype: float64

In [41]:
df

          1         2         3  min  test1
A  2.605967  0.683509  0.302665   10     20
B  1.693723 -1.706086 -1.159119   11     22
C -0.134841  0.390528  0.166905   12     24
D  0.184502  0.807706  0.072960   13     26
E  0.638787  0.329646 -0.497104   14     28
F -0.754070 -0.943406  0.484752   15     30

In [50]:
df.iloc[0:-1:2]

          1         2         3  min  test1
A  2.605967  0.683509  0.302665   10     20
C -0.134841  0.390528  0.166905   12     24
E  0.638787  0.329646 -0.497104   14     28

In [51]:
df.iloc[:,0:2]

          1         2
A  2.605967  0.683509
B  1.693723 -1.706086
C -0.134841  0.390528
D  0.184502  0.807706
E  0.638787  0.329646
F -0.754070 -0.943406

In [52]:
df.iloc[0:2,:]

          1         2         3  min  test1
A  2.605967  0.683509  0.302665   10     20
B  1.693723 -1.706086 -1.159119   11     22

In [53]:
df.iloc[[1,3]]

          1         2         3  min  test1
B  1.693723 -1.706086 -1.159119   11     22
D  0.184502  0.807706  0.072960   13     26

In [54]:
df.iloc[1,3]

11

In [55]:
df > 3

       1      2      3   min  test1
A  False  False  False  True   True
B  False  False  False  True   True
C  False  False  False  True   True
D  False  False  False  True   True
E  False  False  False  True   True
F  False  False  False  True   True

In [56]:
df[df>0]

          1         2         3  min  test1
A  2.605967  0.683509  0.302665   10     20
B  1.693723       NaN       NaN   11     22
C       NaN  0.390528  0.166905   12     24
D  0.184502  0.807706  0.072960   13     26
E  0.638787  0.329646       NaN   14     28
F       NaN       NaN  0.484752   15     30

In [61]:
df[df['min']>12]

          1         2         3  min  test1
D  0.184502  0.807706  0.072960   13     26
E  0.638787  0.329646 -0.497104   14     28
F -0.754070 -0.943406  0.484752   15     30

In [62]:
df[df['test1']>24]['min']

D    13
E    14
F    15
Name: min, dtype: int64

In [63]:
df[df['1']>0][['2','3']]

          2         3
A  0.683509  0.302665
B -1.706086 -1.159119
D  0.807706  0.072960
E  0.329646 -0.497104

In [66]:
df[(df['1']>1)&(df['2']>0)]

          1         2         3  min  test1
A  2.605967  0.683509  0.302665   10     20

In [74]:
x = (['test2','Female','3523-12-04','1000000'],
['test1','Male','5125-04-42','6000000'],
['test3','Female','1252-08-21','5000000'],
['test4','Male','2016-11-52','4000000'],
['test5','Male','2124-02-12','2000000'])

df = pd.DataFrame((x),index='100111 100112 200210 200211 300207'.split(),columns='name gender hiredate grosssalary'.split())

In [75]:
df[df['name'] == 'test4']

         name gender    hiredate grosssalary
200211  test4   Male  2016-11-52     4000000

In [76]:
df[df['gender'] =='Male']

         name gender    hiredate grosssalary
100112  test1   Male  5125-04-42     6000000
200211  test4   Male  2016-11-52     4000000
300207  test5   Male  2124-02-12     2000000